【简化规约（点击链接查看详细内容）】

基本规则 http://rmtemp.lofter.com/post/3e26fe_156e50a

不需要报告 http://rmtemp.lofter.com/post/3e26fe_156f16f

不需要署名（仅针对免费游戏） http://rmtemp.lofter.com/post/3e26fe_156e513

自由的用于任何游戏中（用于收费游戏或用于参加比赛的游戏中时要求署名） http://rmtemp.lofter.com/post/3e26fe_156f11b

允许加工 http://rmtemp.lofter.com/post/3e26fe_156f131

可以自由的二次配布 http://rmtemp.lofter.com/post/3e26fe_156f1c7

【其他规约】

如果免费游戏附带有使用的素材列表的话（例如在游戏ED、游戏介绍文档、游戏发布帖中）则要求署名（因为这种情况下不署名可能会造成“这个脚本是游戏作者自己原创的”的误解）。

这些脚本只适用于RPG制作大师VA，基于原生的RGSS3脚本编写。较早期的脚本兼容性略微差一些，把这些脚本放到其他外挂脚本的上方可以尽可能多的避免发生脚本冲突。

脚本开头的说明中如果有特殊的使用协议的话，以脚本说明中的使用协议为准。

不接受脚本定制。（当然如果你愿意付费的话我会考虑的）。

脚本的使用规约可能会在不作特别通知的情况下修改，发布游戏前请来确认一下。（请放心，脚本规约的修改一般情况下只是针对之前规约的疏漏进行补充，并不会突然增加收费的条款。）
