=begin
===============================================================================
  【插件】不公开配方的合成脚本 - 消耗合成素材
===============================================================================

  【说明】

  在事件指令的脚本中输入

    M5Combin20141204::Tool6.cost

  可以消耗上一次合成时选择的合成素材

  利用这个指令，可以做出即使合成失败也消耗素材的效果

=end
raise "本脚本需要放在合成脚本下方" unless $m5script[:M5Combin20141204]
raise "合成脚本版本过低！" if $m5script[:M5Combin20141204] < 20150706
module M5Combin20141204;module Tool6
#==============================================================================
#  设定部分
#==============================================================================

  ITEM = 1

  # 执行一次指令后消耗的素材个数

#==============================================================================
#  设定结束
#==============================================================================
  def self.cost
    $game_variables[M5Combin20141204::VAR].each do |id|
      $game_party.gain_item($data_items[id], -ITEM)
    end
  end
end;end
