=begin
===============================================================================
  【插件】不公开配方的合成脚本 - 合成失败后处理
===============================================================================

  【说明】

  对《不公开配方的合成脚本 By喵呜喵5》合成失败后追加一些特殊的处理

  不需要这个插件的话，直接把这个脚本删掉就好了

=end
raise "本脚本需要放在合成脚本下方" unless $m5script[:M5Combin20141204]
raise "合成脚本版本过低！" if $m5script[:M5Combin20141204] < 20150706
module M5Combin20141204;module Tool6
#==============================================================================
#  设定部分
#==============================================================================

  ITEM = 1

  # 合成失败后用于合成的素材消失

#==============================================================================
#  设定结束
#==============================================================================
end;end
class Game_Interpreter
  alias m5_20160416_combin_fail m5_20141204_combin_fail
  def m5_20141204_combin_fail
    m5_20160416_combin_fail
    $game_variables[M5Combin20141204::VAR].each do |id|
      $game_party.gain_item($data_items[id], - M5Combin20141204::Tool6::ITEM)
    end
  end
end