=begin
===============================================================================
  【插件】不公开配方的合成脚本 - 帮助窗口控制
===============================================================================

  【说明】

  可以控制《不公开配方的合成脚本 By喵呜喵5》中的物品窗口

  不需要这个插件的话，直接把这个脚本删掉就好了

=end
module M5Combin20141204;module Tool3
#==============================================================================
#  设定部分
#==============================================================================

  MAX = 4

  # 最多允许素材的个数

  MIN = 2

  # 合成素材的最少个数
  # 当已经选择的素材少于最大素材且大于最少素材时按A键可以只使用选择的素材进行合成

  # 以下的设置按照这个格式填写：
  # [ 第1个物品窗口的设置, 第2个物品窗口的设置, …… , 第N个物品窗口的设置 ]
  # 如果只填写一个设置的话，所有的窗口都使用这个设置

  # 前后要加上英文双引号，每个设置用英文逗号分隔

  X = [17,184,17,184]

  # 各个物品窗口的X坐标，有几个物品窗口就按格式添加几个

  Y = [48,48,190,190]

  # 各个物品窗口的Y坐标，有几个物品窗口就按格式添加几个

  WIDTH = 146

  # 各个物品窗口的宽度，有几个物品窗口就按格式添加几个

  HEIGHT = 112

  # 各个物品窗口的高度，有几个物品窗口就按格式添加几个

  SKIN = "Window2"

  # 各个物品窗口的窗口皮肤，有几个物品窗口就按格式添加几个

  HIDE = false

  # 各个物品窗口是否隐藏背景只显示文字，有几个物品窗口就按格式添加几个
  # （true：隐藏，false：不隐藏）

#==============================================================================
#  设定结束
#==============================================================================
end;end
class Scene_Combin
  def m5_20141205_check_value(value,name)
    if value.is_a?(Array)
      return value if value.size == material_max
      raise "《不公开配方的合成脚本》中，部分物品窗口没有设置#{name}！"
    else
      return Array.new(material_max,value)
    end
  end
  def material_max;Tool3::MAX;end
  def material_min;Tool3::MIN;end
  def m_win_x;m5_20141205_check_value(Tool3::X,"X坐标");end
  def m_win_y;m5_20141205_check_value(Tool3::Y,"Y坐标");end
  def m_win_width;m5_20141205_check_value(Tool3::WIDTH,"宽度");end
  def m_win_height;m5_20141205_check_value(Tool3::HEIGHT,"高度");end
  def m_win_skin;m5_20141205_check_value(Tool3::SKIN,"皮肤");end
  def m_win_back;m5_20141205_check_value(Tool3::HIDE,"背景隐藏");end
end