=begin
===============================================================================
  【插件】不公开配方的合成脚本 - 跳过合成按键设置
===============================================================================

  【说明】

  更改《不公开配方的合成脚本 By喵呜喵5》中使用当前素材进行合成的按键

  搭配插件《物品窗口控制》共同使用

  不需要这个插件的话，直接把这个脚本删掉就好了

=end
raise "本脚本需要放在合成脚本下方" unless $m5script[:M5Combin20141204]
raise "合成脚本版本过低！" if $m5script[:M5Combin20141204] < 20150811
module M5Combin20141204;module Tool6
#==============================================================================
#  设定部分
#==============================================================================

  INPUT = :X

  # 设置跳过合成的按键
  # 允许设置以下按键：
  #  :LEFT :RIGHT :A :X :Y :Z :L :R :SHIFT :CTRL :ALT :F5 :F6 :F7 :F8 :F9
  # 设置的按键与键盘的对应关系请启动游戏后按 F1 查看

#==============================================================================
#  设定结束
#==============================================================================
end
class Window_List
  def check_skip; return Input.trigger?(Tool6::INPUT); end
end
end