=begin
===============================================================================
  超过四行的显示文字指令 By喵呜喵5
===============================================================================

【说明】

  使事件指令中的显示文字功能能够显示超过四行的文字
  
  在设定部分的两个“HEREHEREHERE”之间输入文字，之后运行游戏即可导入
  
  文字将被导入进公共事件1中，可以自由的复制到需要的地方
  编辑导入的文字则会被编辑器强制恢复成四行
  
  如果公共事件1的最后是一个显示文字的指令的话，
  导入的文字将自动接在这个指令显示的文字之后
  利用这一特点可以设置导入文字的脸图、窗口背景、位置……
  
=end
$m5script ||= {};$m5script[:M5IM20141006] = 20141006
#==============================================================================
# 设定部分
#==============================================================================
text = <<HEREHEREHERE
卧槽情怀接地气，神马浮云很给力。
十动然拒又撕逼，也是醉了你麻痹。

哈哈哈哈 2 3 3，看脸拉黑果取关。
元芳你丫怎么看，碉堡神烦瀑布汗。

直男癌干绿茶婊，矮油不错这个屌。
美分五毛细软跑，快递开门查水表。

累觉不爱小鲜肉，男神女神呵呵后。
沙发板凳打酱油，土豪我们做朋友。

菜鸟给跪战五渣，感觉自己萌萌哒。
逗比备胎么么哒，啪啪啪后来一发。

嘴说不要体诚实，婊砸又名小碧池。
火钳刘明涨姿势，尼玛这是人干事？

邪魅一笑小妖精，补药碧莲好桑心。
贱人就是很矫情，你们图样图年轻。

长发及腰也滚粗，蛋疼菊紧得hold住。
谢邀反对没帮助，屌丝逆袭高帅富。

吊打蜗壳爆出翔，也是蛮拼正能量。
学挖掘机哪家强，中国山东找蓝翔。

(文字：性浪微博 @楚沐风)

HEREHEREHERE
#==============================================================================
# 设定结束
#==============================================================================
event = load_data("Data/CommonEvents.rvdata2")  
end_command = event[1].list.pop
if event[1].list[-1] && event[1].list[-1].code == 401
else
  event[1].list.push RPG::EventCommand.new(101,0,["",0,0,2])
end
text.each_line do |line|
  line.chomp!
  event[1].list.push RPG::EventCommand.new(401,0,[line])
end
while event[1].list[-1].parameters[0] == ""
  event[1].list.pop
end
event[1].list.push end_command
save_data(event,"Data/CommonEvents.rvdata2")

msgbox "导入完毕！#{$TEST ? "\n请重新启动编辑器以查看效果" : ""}"
exit
