=begin
===============================================================================
  逆转裁判式证言系统 By喵呜喵5
===============================================================================

【说明】

  模仿《逆转裁判》中法庭证言系统的脚本

  脚本生效后，可以使用脚本开头设置的任何一个按键进入下一句对话，

  根据玩家所使用按键的不同的，对应变量的值也会不同

  当然，如果你真的想用这个脚本做一个逆转裁判的话请把事件指令用熟练了再说

=end
$m5script ||= {} ;$m5script[:M5SB20141206] = 20141206
module M5SB20141206
#==============================================================================
# 设定部分
#==============================================================================

  INPUT = [:B, :C, :LEFT, :RIGHT]

  # 在这里输入希望用到的按键
  # 支持的按键：
  # DOWN LEFT RIGHT UP：分别对应方向键中的下、左、右、上。
  # A B C X Y Z L R：分别对应游戏中F1里设置的按键。
  # SHIFT CTRL ALT：直接对应键盘上面的 Shift、Ctrl 和 Alt 按键。
  # F5 F6 F7 F8 F9：对应与之相对应的键盘上的功能键。

  VAR = 1

  #这里填写一个变量ID，结束一句对话后这个变量的值将变成所按按键在按键列表中的位置

  SWI = 1

  #在这里填写一个开关ID，开关开启的时候不使用本脚本

#==============================================================================
# 脚本部分
#==============================================================================
end
class Window_Message
  alias m5_20140428_input_pause input_pause
  def input_pause
    if $game_switches[M5SB20141206::SWI]
      m5_20140428_input_pause
    else
      self.pause = true
      wait(10)
      Fiber.yield until m5_20140428_input_judge
      Input.update
      self.pause = false
    end
  end
  def m5_20140428_input_judge
    M5SB20141206::INPUT.each_with_index do |input,index|
      if Input.trigger?(input)
        $game_variables[M5SB20141206::VAR] = index + 1
        return true
      end
    end
    false
  end
end