=begin
===============================================================================
  消除远景图视差 By喵呜喵5
===============================================================================

【说明】

  RM默认的远景图和地图之间有视差，
  在大地图上，当玩家在地图上移动一步时远景图并不会移动相同的距离

  使用本脚本可以消除文件名开头包含“!”的远景图的视差
  同时，对应的开关打开时也可以将所有远景图的视差都消除

  这个脚本适用于需要使用远景图制作地图的情况

=end
$m5script ||= {};$m5script[:M5FP20141221] = 20151018
module M5FP20141221
#==============================================================================
#  设定部分
#==============================================================================

  SWI = 1

  # 当对应ID的开关打开时，任意远景图都将固定在地图上

#==============================================================================
#  设定结束
#==============================================================================
  def self.name
    "\!"
  end
end
class Spriteset_Map
  alias m5_20141221_update_parallax update_parallax
  def update_parallax
    m5_20141221_update_parallax
    f = $game_map.parallax_name[/^[#{M5FP20141221.name}]./]
    return unless ( f && f.include?('!') ) || $game_switches[M5FP20141221::SWI]
    @parallax.ox = @tilemap.ox
    @parallax.oy = @tilemap.oy
  end
end