=begin
===============================================================================
  遇敌率控制 By喵呜喵5
===============================================================================

  【说明】

  通过设定的变量控制遇敌几率

=end
$m5script ||= {};$m5script[:M5EC20150131] = 20150131
module M5EC20150131
#==============================================================================
#  设定部分
#==============================================================================

  VAR = 1

  # 这里设置用来控制遇敌率的变量ID，对应ID的变量大于0时遇敌率会发生改变

  RATE = 0.1

  # 这里设置遇敌率改变的幅度，遇敌率会变更为 RATE*VAR

  # 默认情况下的计算公式为：
  # 变量1的数值为1，遇敌率变更幅度为0.1时，遇敌率变成1*0.1 = 0.1倍

#==============================================================================
#  设定结束
#==============================================================================
end
class Game_Player
  alias m5_20150131_encounter_progress_value encounter_progress_value
  def encounter_progress_value
    value = m5_20150131_encounter_progress_value
    return value if $game_variables[M5EC20150131::VAR] <= 0
    value *= (M5EC20150131::RATE).abs * $game_variables[M5EC20150131::VAR]
  end
end