=begin
===============================================================================
  事件指令参数修改 By喵呜喵5
===============================================================================

【说明】

  修改指定事件指令的参数
  
  在事件中使用脚本输入
  
    m520150501_change({1=>10,2=>20})
   
  可以将下一行对应事件指令的第一个和第二个参数值分别修改成10和20
  
  利用这个脚本可以在某些默认不支持使用随机数作为参数的事件指令里使用随机数
  
  使用这个脚本需要一定的脚本基础，如果搞不懂意思的话，不建议使用

=end
$m5script ||= {};$m5script[:M5CP20150501] = 20150501
#==============================================================================
# 脚本部分
#==============================================================================
class Game_Interpreter  
  def m520150501_change(param_list={}, offset=1)
    command = @list[@index + offset]
    params = command.parameters
    param_list.each do |pos,value|
      next unless params[pos-1]
      params[pos-1] = value
    end
  end  
end