=begin
===============================================================================
  修改菜单选项 By喵呜喵5
===============================================================================

【说明】

  可以删除默认菜单中不需要的选项

  也可以设置当某个开关打开的时候指定的选项才出现在菜单中

=end
$m5script ||= {};$m5script[:M5MC20140822] = 20150628
module M5MC20140822
#==============================================================================
#  设定部分
#==============================================================================

  # 请依次填写每个选项对应的出现条件
  # 小于零：始终出现
  # 等于零：不出现
  # 大于零：对应ID的开关打开时才出现

  COMMAND = {

    :item => -1,

    # 设置道具的出现条件

    :skill => 0,

    # 设置技能的出现条件

    :equip => 1,

    # 设置装备的出现条件

    :status => 0,

    # 设置状态的出现条件

    :game_end => -1,

    # 设置游戏结束的出现条件

    :save => 0,

    # 设置存档的出现条件

    :formation => -1,

    # 设置整队的出现条件

  }

#==============================================================================
#  设定结束
#==============================================================================
end
class Window_MenuCommand
  alias m5_20140822_make_command_list make_command_list
  def make_command_list
    m5_20140822_make_command_list
    @list.delete_if {|c| m5_20140822_judge_command c[:symbol] }
  end
  def m5_20140822_judge_command(sym)
    id = M5MC20140822::COMMAND[sym]
    return false unless id
    return false if id < 0
    !$game_switches[id]
  end
end